{"keras_version": "1.1.1", "config": [{"class_name": "LSTM", "config": {"input_length": null, "return_sequences": true, "W_regularizer": null, "go_backwards": false, "U_regularizer": null, "trainable": true, "dropout_U": 0.0, "unroll": false, "output_dim": 64, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "forget_bias_init": "one", "consume_less": "cpu", "activation": "tanh", "b_regularizer": null, "batch_input_shape": [64, 128, 6], "name": "lstm_1", "dropout_W": 0.0, "stateful": false, "init": "glorot_uniform", "input_dim": 6, "input_dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "LSTM", "config": {"activation": "tanh", "input_length": null, "return_sequences": false, "W_regularizer": null, "go_backwards": false, "b_regularizer": null, "input_dim": 64, "trainable": true, "U_regularizer": null, "name": "lstm_2", "dropout_W": 0.0, "dropout_U": 0.0, "stateful": false, "init": "glorot_uniform", "output_dim": 64, "inner_activation": "hard_sigmoid", "unroll": false, "inner_init": "orthogonal", "consume_less": "cpu", "forget_bias_init": "one"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Dense", "config": {"activation": "softmax", "b_regularizer": null, "W_regularizer": null, "trainable": true, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "output_dim": 2, "input_dim": null, "activity_regularizer": null, "bias": true, "b_constraint": null}}], "class_name": "Sequential"}