{"config": [{"class_name": "LSTM", "config": {"input_length": null, "output_dim": 64, "unroll": false, "init": "glorot_uniform", "activation": "tanh", "W_regularizer": null, "name": "lstm_1", "b_regularizer": null, "input_dtype": "float32", "dropout_W": 0.0, "trainable": true, "stateful": false, "forget_bias_init": "one", "input_dim": 6, "return_sequences": true, "consume_less": "cpu", "dropout_U": 0.0, "batch_input_shape": [64, 128, 6], "go_backwards": false, "U_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"trainable": true, "input_length": null, "forget_bias_init": "one", "output_dim": 64, "input_dim": 64, "stateful": false, "return_sequences": false, "activation": "tanh", "consume_less": "cpu", "dropout_U": 0.0, "go_backwards": false, "W_regularizer": null, "name": "lstm_2", "U_regularizer": null, "unroll": false, "inner_activation": "hard_sigmoid", "b_regularizer": null, "dropout_W": 0.0, "inner_init": "orthogonal", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "output_dim": 2, "input_dim": null, "activation": "softmax", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "bias": true, "activity_regularizer": null}}], "class_name": "Sequential", "keras_version": "1.1.1"}