{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "dropout_W": 0.0, "return_sequences": true, "stateful": false, "init": "glorot_uniform", "W_regularizer": null, "batch_input_shape": [64, 128, 6], "forget_bias_init": "one", "dropout_U": 0.0, "unroll": false, "b_regularizer": null, "input_dim": 6, "consume_less": "cpu", "trainable": true, "activation": "tanh", "output_dim": 64, "go_backwards": false, "inner_init": "orthogonal", "U_regularizer": null, "inner_activation": "hard_sigmoid", "input_length": null, "input_dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "dropout_W": 0.0, "unroll": false, "b_regularizer": null, "input_dim": 64, "consume_less": "cpu", "trainable": true, "stateful": false, "init": "glorot_uniform", "return_sequences": false, "go_backwards": false, "inner_init": "orthogonal", "output_dim": 64, "W_regularizer": null, "U_regularizer": null, "inner_activation": "hard_sigmoid", "input_length": null, "forget_bias_init": "one", "activation": "tanh", "dropout_U": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "input_dim": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "output_dim": 2, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax"}}]}